n5/src/Catalogs/BankingApps/BankingApps.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>BankingApps</name>
  <attributes>
    <name>Application</name>
    <type>
      <types>EnumRef.Banks</types>
    </type>
  </attributes>
  <attributes>
    <name>Globus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Loading</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OnExpense</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>OnReceipt</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Unloading</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/Enums/Banks/Banks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Banks</name>
  <enumValues>
    <name>Comert</name>
  </enumValues>
  <enumValues>
    <name>Energbank</name>
  </enumValues>
  <enumValues>
    <name>EuroCreditBank</name>
  </enumValues>
  <enumValues>
    <name>Eximbank</name>
  </enumValues>
  <enumValues>
    <name>FinComPay</name>
  </enumValues>
  <enumValues>
    <name>MAIB</name>
  </enumValues>
  <enumValues>
    <name>Mobias</name>
  </enumValues>
  <enumValues>
    <name>ProCreditBank</name>
  </enumValues>
  <enumValues>
    <name>VictoriaBank</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/BankingApps/Forms/Form/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )

	readAppearance ();
	Appearance.Apply ( ThisObject );

EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|Globus show Object.Application = Enum.Banks.MAIB;
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure

&AtServer
Procedure BeforeWriteAtServer ( Cancel, CurrentObject, WriteParameters )

	CurrentObject.Description = Object.Application;

EndProcedure
 
// *****************************************
// *********** Group Form

&AtClient
Procedure ApplicationOnChange ( Item )
	
	applyApplication ();
	
EndProcedure

&AtServer
Procedure applyApplication ()
	
	if ( Object.Application <> PredefinedValue ( "Enum.Banks.MAIB" ) ) then
		Object.Globus = "";
	endif;
	Appearance.Apply ( ThisObject, "Object.Application" );
	
EndProcedure
 
&AtClient
Procedure LoadingStartChoice ( Item, ChoiceData, StandardProcessing )
	
	StandardProcessing = false;
	BankingForm.ChooseLoadingFile ( Object.Application, Item );
	
EndProcedure

&AtClient
Procedure UnloadingStartChoice ( Item, ChoiceData, StandardProcessing )

	StandardProcessing = false;
	BankingForm.ChooseFolder ( Item );

EndProcedure
